In [2]:
import numpy as np
import pandas as pd

In [4]:
wages ={"Name": ["Hakan","Selin","Poyraz","Çağan"],
        "Department": ["Programming","Sales","Human Resources","Programming"],
        "Wages": [520,290,312,438]   
        }

In [6]:
wagesDataFrame = pd.DataFrame(wages)
wagesDataFrame

     Name       Department  Wages
0   Hakan      Programming    520
1   Selin            Sales    290
2  Poyraz  Human Resources    312
3   Çağan      Programming    438

In [9]:
wagesDataFrame["Department"].unique()
#Only bring one of repeating departments

array(['Programming', 'Sales', 'Human Resources'], dtype=object)

In [11]:
wagesDataFrame["Department"].nunique()
#Outputs number of unique elements in departments

3

In [14]:
wagesDataFrame["Department"].value_counts()

Programming        2
Human Resources    1
Sales              1
Name: Department, dtype: int64

In [15]:
def wageAdjustment(wage):
    return wage * 1.4

In [16]:
wagesDataFrame["Wages"].apply(wageAdjustment)

0    728.0
1    406.0
2    436.8
3    613.2
Name: Wages, dtype: float64

In [17]:
wagesDataFrame.isnull()

    Name  Department  Wages
0  False       False  False
1  False       False  False
2  False       False  False
3  False       False  False

In [25]:
nbaPlayers = {"Teams": ["Celtics","Celtics","Warriors","Warriors","Warriors"],
             "Players": ["Tatum","Brown","Curry","Klay","Klay"],
             "Age": [24,25,31,29,27]}

In [26]:
playersDF = pd.DataFrame(nbaPlayers)

In [27]:
playersDF

      Teams Players  Age
0   Celtics   Tatum   24
1   Celtics   Brown   25
2  Warriors   Curry   31
3  Warriors    Klay   29
4  Warriors    Klay   27

In [31]:
playersDF.pivot_table(values = "Age", index = ["Teams","Players"],aggfunc=np.sum)

                  Age
Teams    Players
Celtics  Brown     25
         Tatum     24
Warriors Curry     31
         Klay      56